yoga1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" /> 
</head>
<body>
<div id="content">
<div id="outline-container-org7fe3651" class="outline-2">
<h2 id="org7fe3651"><span class="section-number-2">1</span> Start</h2>
<div class="outline-text-2" id="text-1">
<p>
I was walking to class today. and I noticed this&#x2026;
</p>

<p>
little 🌿sprig of green, pushing its way out of the cement.
</p>

<p>
Now, I couldn't tell if it was a flower, a plant, or a weed.
</p>

<p>
.. But I respected its persistence. &#x2026; &#x2026;
</p>

<p>
We all have a ceiling .. like that 🌿sprig. And like that little 🌿sprig did, ..&gt;
</p>

<p>
We have to break throgh .. to achieve our full potential.
</p>

<p>
For my new students, .. this is your first step.
</p>

<p>
Today is your first step in your growth .. toward what you're meant to be.
</p>


<p>
Now, I only noticed that, &#x2026; 'cause that woman in front of me, ..
</p>

<p>
She stepped aside so not to step on it. &#x2026;
</p>

<p>
Let's come to standing, please, Warm up.
</p>


<p>
<i>Big inhale</i>
</p>

<p>
<i>Rise</i>
</p>

<p>
<i>Exhale and swan dive into your forward fold. Keep your knees bent, ~ease your body into that stretch.</i>
</p>

<p>
<b>Beautiful</b>  ..
</p>

<p>
<b>Bravo</b> &#x2026;
</p>

<p>
Now, that woman was exactly what you imagine.
</p>

<p>
One big hand on her cell phone.
</p>

<p>
<i>Big inhale, hands to knees, halfway lift</i>
</p>

<p>
<b>Beautiful, long spine</b> &#x2026;
</p>

<p>
What's the lesson here? ..
</p>

<p>
Hmm? &#x2026;
</p>

<p>
That 🌿sprig was small .. It was significant, it was .. in an inconvenient place. it probably had no right to be in! &#x2026;
</p>

<p>
But it wasn't ashamed.
</p>

<p>
<i>Exhale, drawing back into your forward fold</i>
</p>

<p>
Could have been just a weed, but &#x2026; she stpeed aside.
</p>

<p>
The world wants you to be exactly like that.
</p>

<p>
Small
</p>

<p>
Insignificant
</p>

<p>
Inconvenient
</p>

<p>
<i>Rise with a flat back</i>
</p>

<p>
<i>Big inhale, exhale, hands to heart</i>  🙏
</p>

<p>
<b>Beautiful</b> 
</p>

<p>
But if you stand tall, &#x2026; if you are who you are with no apology &#x2026;
</p>

<p>
the world has to reckon with you.
</p>

<p>
It will have to.
</p>

<p>
Let us begin.
</p>

<p>
Om 🎵
</p>
</div>
</div>


<div id="outline-container-orgcd0212a" class="outline-2">
<h2 id="orgcd0212a"><span class="section-number-2">2</span> Asana</h2>
<div class="outline-text-2" id="text-2">
<p>
This is warrior two. &#x2026;
</p>

<p>
This one hurts. .. I know &#x2026; But It was suppoed to hurt &#x2026; &#x2026;
</p>

<p>
Legs are shaking .. Arms are aching .. I know
</p>

<p>
But the key to this pose is standing tall.
</p>

<p>
Grow through your heart. &#x2026;
</p>

<p>
I know, it's suppoed to burn. &#x2026; 
</p>

<p>
Welcome the pain. ..
</p>

<p>
Embrace the discomfort.
</p>

<p>
👂'You are ascending'
</p>

<p>
But that's the thing about we warriors.
</p>


<p>
We stand tall when it hurts .. especially when it hurts .. when it aches.
</p>

<p>
We stand tall, like that little 🌿sprig.  🤸
</p>

<p>
<i>Breathe</i>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
